# スイッチの役割
## L2スイッチ
データリンク層で動作する。
同じネットワーク内で接続する。
MACアドレスに基づいて、パケットを転送する。

## L3スイッチ
ネットワーク層で動作する。
異なるネットワークを接続する。
IPアドレスに基づいて、パケットを転送する。
L2よりも高機能のため、高価なことが多い。

## VLAN
LAN内を仮想的に分割する技術

## 主な実機メーカー
Cisco や YAMAHAのシェアが大きい。

---
</br>


# Cisco IOS
## モードの種類
- ユーザEXECモード
    - 制限された確認コマンド

- 特権EXECモード
    - 全ての確認コマンド
    enable

- 各種コンフィグレーションモード
    - 設定用コマンド
    configure terminal

- モードを戻りたい時
    - exit

- インターフェースに入る
    - interface fastEtharnet 0/1
    - swichport mode access
    - swichport access vlan 10
---
</br>


# L2スイッチ
## ブロードキャストストーム
通信がループしてしまう現象。


## STP(スパニングツリープロトコル)
通信経路がループしていることを検知した時に、一箇所のみ

---
</br>


## 手順
```bash
# vlan作成
sw01>enable
sw01#configure terminal
sw01(config)#vlan 10
sw01(config-vlan)#

# vlanをインターフェースへ適用
sw01(config)#interface fastEtharnet 0/1
sw01(config-if)#swichport mode access
sw01(config-if)#swichport access vlan 10

```
---
</br>
</br>
</br>





# ルーティングの基本
異なるLAN内のコンピュータを物理接続しても、お互いに通信することはできません。
ルータやL3スイッチを経由して、別ネットワークに到達する必要がある。
この動きを`ルーティング`という。


## Router 初期設定
- 動的：
    - 自動で最適な選択をするルート

- 静的：
    - 手動で選択するルート

- インターフェース
    - 接続ポートをインターフェースという。

</br>

## -- IPアドレスの設定 --
```bash
# 特権モードへ
Router>enable
Router#

# 設定モードへ
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#

# インターフェースモードに入る
Router(config)#interface GigabitEthernet 0/0/0
Router(config-if)#

# IPを設定
#Router(config-if)#ip address "IPアドレス" "ネットマスク"
Router(config-if)#ip address 172.31.0.1 255.255.255.0

# 設定を反映
Router(config-if)#no shutdown
Router(config-if)#exit

# 【任意】ホストネームを変更
Router(config)#hostname rt01
rt01(config)#
```
---
</br>


## -- 疎通確認 --
```bash
Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#interface GigabitEthernet 0/0/0
Router(config-if)#
Router(config-if)#ip address 172.31.0.2 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface gigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface gigabitEthernet0/0/0, changed state to up

Router(config-if)#
Router(config-if)#exit
Router(config)#hostname rt02
rt02(config)#
```
▼ `rt01` から疎通確認
```bash
rt01#ping 172.31.0.2
```
---
</br>


## -- 異なるネットワークでの疎通確認 --
▼ `rt03` にIPアドレスを設定
```bash
Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#interface gigabitEthernet0/0/0
Router(config-if)#
Router(config-if)#ip address 172.31.1.3 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-3-UPDOWN: Interface GigabitEthernet0/0/0, changed state to down

Router(config-if)#
Router(config-if)#exit
Router(config)#
Router(config)#hostname rt03
rt03(config)#
```
▼ `rt02` の `GigabitEthernet0/0/1` に設定
```bash
rt02>enable
rt02#
rt02#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
rt02(config)#
rt02(config)#interface gigabitEthernet0/0/1
rt02(config-if)#
rt02(config-if)#ip address 172.31.1.2 255.255.255.0
rt02(config-if)#
rt02(config-if)#no shutdown
rt02(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/1, changed state to up

rt02(config-if)#
```
▼ `rt02` → `rt03` に疎通確認
```bash
rt02#ping 172.31.1.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.31.1.3, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 0/0/0 ms

rt02#
```
---
</br>


## -- ルーティングテーブル --

▼ `rt01` のルーティングを確認
```bash
rt01#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     172.31.0.0/16 is variably subnetted, 2 subnets, 2 masks
C       172.31.0.0/24 is directly connected, GigabitEthernet0/0/0
L       172.31.0.1/32 is directly connected, GigabitEthernet0/0/0

rt01#
```
▼ `rt01` から `rt03` へのルートを追加
```bash
# ip route "行き先のIP" "経由IP"
rt01(config)#ip route 172.31.1.0 255.255.255.0 172.31.0.2
rt01(config)#
rt01(config)#exit
rt01#
rt01#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     172.31.0.0/16 is variably subnetted, 3 subnets, 2 masks
C       172.31.0.0/24 is directly connected, GigabitEthernet0/0/0
L       172.31.0.1/32 is directly connected, GigabitEthernet0/0/0
S       172.31.1.0/24 [1/0] via 172.31.0.2

rt01#
```
※ Sはstaticの略。静的を意味する。

▼ `rt03` から `rt01` への戻りルートを追加
```bash
rt03(config)#ip route 172.31.0.0 255.255.255.0 172.31.1.2
rt03(config)#exit
rt03#
rt03#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     172.31.0.0/16 is variably subnetted, 3 subnets, 2 masks
S       172.31.0.0/24 [1/0] via 172.31.1.2
C       172.31.1.0/24 is directly connected, GigabitEthernet0/0/0
L       172.31.1.3/32 is directly connected, GigabitEthernet0/0/0

rt03#
```

▼ `rt01` から `rt03` への疎通確認
```bash
rt01#ping 172.31.1.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.31.1.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 0/0/0 ms

rt01#
```
---
</br>


## ルーティングの種類
- スタティックルート
    - ルートを固定したい場合に使われる。
```bash
ip route "宛先ネットワーク" "宛先ネットワークのネットマスク" "ネクストホップ"
```

- ダイナミックルート
    - 経路に設定していたルータがダウンした時に別ルートを通れるように可変的なルーティング。ルータ同士で `ルーティングプロトコル` と呼ばれるプロトコルでやり取りし、ルーティングテーブルを自動的に更新する。やり取りが完了し、ルーティングテーブルが確定したことを `コンパージェンス` と呼ぶ。
```bash
#rt01(config)#
router ospf "1~65535"

#rt01(config-router)#
network "OSPFを設定するインターフェースのIP" "ワイルドカードマスク" area "エリア番号"

#全て同じospf10番に設定を入れる。
```
▼ 確認コマンド
```bash
# 隣の機器を認識しているかを確認
show ip ospf neighbor

# ルーティングテーブル確認
show ip route
```
▼ 再設定
```bash
no network 172.31.0.1 0.0.0.255 area 0
```
```bash
# rt01
router ospf 10
network 172.31.0.1 0.0.0.255 area 0
network 172.31.1.1 0.0.0.255 area 0

# rt02
router ospf 10
network 172.31.0.2 0.0.0.255 area 0
network 172.31.2.2 0.0.0.255 area 0

# rt03
router ospf 10
network 172.31.1.3 0.0.0.255 area 0
network 172.31.3.3 0.0.0.255 area 0

# rt04
router ospf 10
network 172.31.2.4 0.0.0.255 area 0
network 172.31.3.4 0.0.0.255 area 0
```
---
</br>
</br>

## -- アドミニストレーティブディスタンス --
複数のルーティングがある場合の`優先度`を指す。
値の小さい方が優先度が高い。



```bash
# rt11
interface gigabitEthernet 0/0/0
ip address 172.31.0.1 255.255.255.0
no shutdown

# rt12
interface gigabitEthernet 0/0/0
ip address 172.31.0.2 255.255.255.0
no shutdown
interface gigabitEthernet 0/0/1
ip address 172.31.2.2 255.255.255.0
no shutdown

# rt13
interface gigabitEthernet 0/0/0
ip address 172.31.1.3 255.255.255.0
no shutdown
```
▼ `rt11` → `rt13` に疎通が通るようにする。
```bash
# rt11
ip route 172.31.1.0 255.255.255.0 172.31.0.2
# rt13
ip route 172.31.0.0 255.255.255.0 172.31.1.2
```
▼ `rt14` を追加に伴い、rt11,rt13の新ポートも作成
```bash
# rt11
interface gigabitEthernet 0/0/1
ip address 172.31.2.1 255.255.255.0
no shutdown

# rt13
interface gigabitEthernet 0/0/1
ip address 172.31.3.3 255.255.255.0
no shutdown

# rt14
interface gigabitEthernet 0/0/0
ip address 172.31.2.4 255.255.255.0
no shutdown
interface gigabitEthernet 0/0/1
ip address 172.31.3.4 255.255.255.0
no shutdown
```
▼ 優先度を変更
```bash
# rt11
ip route 172.31.1.0 255.255.255.0 172.31.2.4 2
# rt13
ip route 172.31.0.0 255.255.255.0 172.31.3.4 2
```


## デフォルトルート
「とりあえず、ここに向かえ」と書いてあるルートのこと。

デフォルトルートに指定されている宛先のことを`デフォルトゲートウェイ`

基本的に`全てのネットワーク（0.0.0.0/0）`を選択するようなデフォルトゲートウェイが使われる。

---
</br>


## FHRP（First Hop Redundancy Protocol）
デフォルトゲートウェイを冗長化するプロトコル。

---
</br>
